app/controllers/api/v1/sessions_controller.rb

UPDATE "users" SET "authentication_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["authentication_token", "133432423432423sdfs4343"], ["updated_at", "2016-04-20 04:38:10.924690"], ["id", 1]]
---
  def destroy
    warden.authenticate!(:scope => resource_name, :recall => "#{controller_path}#failure")
    current_user.update_column(:authentication_token, nil)